app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "History"], ["room_number", 103], ["created_at", "2020-07-31 11:29:39.849843"], ["updated_at", "2020-07-31 11:29:39.849843"]]

  def set_classes
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]