app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Evan"], ["last_name", "Smith"], ["created_at", "2020-07-31 10:46:45.203869"], ["updated_at", "2020-07-31 10:46:45.203869"]]
---
      def create
        @student = Student.new
        @student[:first_name] = params[:student][:first_name]
        @student[:last_name] = params[:student][:last_name]
        @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "Williams"], ["updated_at", "2020-07-31 10:51:59.728185"], ["id", 1]]
---
      def update
        @student = Student.find(params[:id])
        @student.update(student_params)